/*
 *	메소드
 *		= 클래스 영역에 설정
 *		= 메소드안에 메소드는 들어갈 수 없다.
 *		= 한가지 기능을 수행할 수 있게 명령문을 사용한다.
 *		  -------- 재사용의 목적
 *		= 유지보수 편리성
 *		= 구조적인 프로그램 => ex) 문단을 나눠서 서술
 *		= 가독성이 좋다
 *		= 에러 처리가 편하자
 *		= 반복을 제거할 수 있다
 *		= 메소드 제작 = 호출
 *				 	---- 무조건 처음부터 다시 시작
 *	-------------------------------------------------
 *	1. 메소드 제작
 *		= 메소드 선언부
 *				=> 리턴형 / 메소드명 / 매개변수 (인자)
 *		= 메소드 구현부
 *				=> 값을 보내주는 방법
 *					=> return 값
 *	2. 호출 순서 / 호출 방법
 *	3. 다른 클래스에 메소드 사용법
 *	4. 어디까지가 한개의 기능인지 확인
 *	   --------------- 재사용이 가능
 *	5. main에서는 변수 / 연산자 / 제어문 => 사용하지 않는다.
 *	   무조건 > 메소드 호출
 *	--------------------------------------------
 *		메소드
 *			= 인스턴스 : new를 이용해서 메소드 저장 후
 *				객체명.메소드() 
 *			= 정적(static) : 컴파일시에 자동으로 저장
 *
 *		메소드 제작
 *			= 사용자로부터 요청값 받아서 요청처리 = 결과값을 전선
 *			= 리턴형 1개만 설정, 매개변수 => 사용자가 요청값(여러개 사용 가능)
 *
 *		리턴형
 *			= 사용자 요청 처리 => 결과값을 보내준다
 *			= 결과값은 한개만 보내주고 여러개면 배열, 컬렉션, 사용자 정의 클래스
 *		
 *		매개변수
 *			= 사용자가 보내준 값
 *			= 여러개를 보내주고 받을 수 있다.
 *
 *		메소드명
 *			= 변수 식별자와 동일 (소문자로 시작)
 *		----------------------------------------------------------
 *		형식)
 *			선언부
 *			리턴형 메소드명(매개변수 ...)
 *			구현부
 *			{
 *				... 요청처리
 *				return 값;
 *					  --- 리턴형의 데이터형과 동일
 *			}
 *
 *			호출
 *				메소드명(매개변수에 값을 설정)
 *
 *			예)
 *				int add(int a, int b) {
 *					return a + b;
 *				}
 *
 *				int a = add(10, 20) // 30
 *				void는 메소드만 호출
 * 
 */
// 사용자로부터 단을 받아서 => 해당 단의 구구단 출력 => 매개변수 존재 / 리턴형 X

import java.util.Scanner;

public class 메소드_1 {
	
	static void gugudan(int dan) {
		for(int i=1; i<=9; i++) {
			System.out.println(dan + " * " + i + " = " + dan*i);
		}
		return; // void일 경우에만 생략이 가능
		// 생략일 경우에는 컴파일시에 자동으로 return을 추가해준다.
	}

	static void process() {
		Scanner scan = new Scanner(System.in);
		System.out.print("2~9까지 사이의 단 입력 : ");
		int dan = scan.nextInt();
		gugudan(dan);
	}
	public static void main(String[] args) {
		// TODO Auto-generated method stub
		process();

	}

}
