/*
 * 		변수 / 배열 / 클래스 / 사용자 클래스 / 인터페이스 => 데이터형
 * 		-------------------------------------
 * 					| 사용자 정의 => class
 * 		연산자 / 제어문 => 항상 동일
 * 		------------ | => 메소드
 * 
 * 		-------------------------------------------------
 * 		| 객체지향 : SOLID / 특성
 * 		| 객체와 객체 연결
 * 		-------------------------------------------------
 * 		예외처리
 * 		-------------------------------------------------
 * 		1) 컬렉션 / IO / 람다식
 * 		2) 어노테이션 / 리플랙션 / JSON
 */
public class 메소드_7 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub   

	}

}
