/*
 * 		1. 클래스의 구성요소
 * 		2. 클래스에서 객체 생성 방법
 * 		3. 생성자의 역할
 * 			=> 객체 생성시 호출하는 메소드 (한번만 사용)
 * 			   -------- 생성자를 이용해서 생성
 * 			=> 인스턴스변수 / static 변수의 초기화
 * 			   *** 클래스 영역은 선언만 가능하다 
 * 			=> 특징
 * 				1) 클래스명과 동일하다 (대소문자 구분)
 * 				2) 리턴형이 없다 (void 불가)
 * 					class A  A() / class B  B()
 * 				3) 생성자는 여러개 만들 수 있다.
 * 					=> 매개변수의 갯수 / 데이터형이 다르다
 * 						A() / A(int a) / A(double d) ...
 * 						A(int a, int b) ...
 * 					=> 오버로딩 지원
 * 		4. 변수 종류
 *			= 지역 변수 : 메소드 영역에서 선언 / 메소드 종료시 소멸
 *			= 정적 변수 : 공유 변수 / 프로그램 종료시에 소멸 => MethodArea
 *					    컴파일시 생성 => 자동으로 생성
 *			= 인스턴스 변수 : 객체마다 따로 가지고 있는 메모리
 *						  프로그램 종료시까지 => 힙
 *						  new를 이용해서 생성
 *			변수 (정적 / 인스턴스)
 *			메소드 (정적 / 인스턴스)
 *			생성자 : 필요 없는 경우 => 자동 생성
 *				   필요 있는 경우 => 직접 생성
 *
 *			변수 / 메소드 => 선언하는 것은 동일
 *			---
 *			 | 1) 기본형
 *			   2) 클래스 => 사용자 정의 / 라이브러리
 *			   3) 배열
 *			   4) 상수 / 열거형
 *		---------------------------
 *		4-1. 접근지정어
 *			 public / protected / default / private
 *		4-2. 제어어
 *			 static / final / abstract
 *		5. 객체지향의 3대 특성
 *			= 캡슐화 : 데이터 보호
 *				=> Getter / Setter
 *					읽기       쓰기  ===> 변수의 기능
 *				=> lombok
 *			= 상속 : 확장 / 재사용
 *				=> extends
 *					상속 내리는 클래스 ==> 재사용
 *					상속 받는 클래스 => 확장
 *				=> 포함 클래스
 *			= 다형성 : 새로운 기능 추가 / 기존의 기능 변경
 *				=> 오버로딩
 *				=> 오버라이딩
 *		6. 다른 클래스와 연동 (클래스 종류)
 *		   추상 클래스 / 인터페이스 / 내부 클래스
 *		--------------------------------------------
 *		사전에 에러 방지 / 비정상 종료 방지 : 예외처리
 *		  => 컴파일 에러 : 반드시 예외처리
 *		  => 실행시 에러 
 */
public class 클래스의구성요소 {
	
	public static void main(String[] args) {
		// TODO Auto-generated method stub
	}

}
