/*
 * 	자바 => 웹 개발 (관련된 자바만 학습)
 * 	---------------------------
 * 	1. 변수 : 프로그램 필요한 데이터 저장
 * 	2. 변수를 요청에 따라 => 처리
 * 		1) 연산자
 * 		2) 제어문
 * 	3. 필요한 데이터를 묶어서 사용 => 배열 / 클래스
 * 	4. 관련된 명령어 묶기 => 메소드
 * 	------------------------------------ + 객체 지향 프로그램
 * 	** 모든 프로그램 : 변수 / 연산자 / 제어문
 * 	5. 비정상 종료 방지 / 사전에 에러 방지 ===> 예외처리
 * 	6. 라이브러리 (검색)
 * 		=> 웹 관련
 * 		   컬렉션 / 데이터베이스 연동
 * 	----------------------------------------------------
 * 	오라클 : 데이터베이스 => 영구적으로 저장
 * 	----------------------------------------------------
 * 	화면 UI : HTML / CSS => 동적 JavaScript
 * 			 *** 오라클 연동
 * 			     --------
 *               HTML <- Java -> 오라클
 *               		   |
 *               		  JSP
 * 	----------------------------------------------------
 * 	형식을 통일화 (표준화)
 * 	----------------
 * 	| => Spring
 * 	| => Jquery => Vue => React
 * 	| => 데이터베이스 => MyBatis / JPA
 * 	-----------------------------------------------------
 * 	지능형 웹 : Spring AI
 * 	-----------------------------------------------------
 * 	배포 : DevOps => CI/CD => AWS
 * 	-----------------------------------------------------
 * 	
 * 	=> 1. 데이터형
 * 		  정수 : byte (파일 업로드, 파일 다운로드), int, long
 * 		  실수 : float, double
 * 				|=> Vector (글자를 => float)
 * 		  논리 : boolean
 * 		  문자열 : String
 * 
 * 	=> 2. 연산자
 * 		  단항 : ++, --, !, (type) : 라이브러리에서 주는 결과값
 * 		  이항 : +, -, *, /, %
 * 			   == != < > <= >=
 * 			   && ||
 * 			   = += -=
 * 		  삼항 : 조건 ? 값 : 값
 * 
 * 	=> 3. 제어문
 * 		  if / if~else
 * 		  for / while ==> 1차 => for-each / while
 * 		  break                 | 화면 출력
 * 
 * 	=> 4. 참조 타입
 * 	   	  배열 => 1차원
 * 		  문자열
 * --------------------------------------------------------
 * 
 * 	=> 변수 => 지역변수
 * 			  ----- 메소드안에 선언 => 자동 메모리 해제
 * 					=> stack (메모리 자체 관리)
 * 					=> 해제 시기 : {}
 * 
 * 	ABCD
 * 	EFGH
 * 	IJKL
 * 	MNOP
 * 
 */
public class 정리1_4장_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		char c = 'A';
		for(int i=1; i<=4; i++) {
			for(int j=1; j<=4; j++) {
				System.out.print(c++);
			}
			System.out.println();
		}
	}

}
